"""
starmap(function, iterable): Викликає функцію для кожного кортежу аргументів з ітерабельного об'єкта.
"""

from itertools import starmap


# Приклад: Додавання елементів пар
def add(x, y):
    return x + y


pairs = [(1, 2), (3, 4), (5, 6)]

result = list(starmap(add, pairs))

print(result)
# Виведення: [3, 7, 11]


"""Функція starmap з модуля itertools також має свої переваги, особливо в контексті обробки даних, які представлені у 
вигляді кортежів чи інших ітерабельних об'єктів:

1. Розгортання аргументів: Основна перевага starmap полягає в тому, що вона дозволяє автоматично розгортати кортежі або 
інші ітерабельні об'єкти як аргументи для функції. Це дозволяє писати більш чистий та читабельний код."""

# Без starmap
pairs = [(1, 2), (3, 4), (5, 6)]
result_without_starmap = [add(pair[0], pair[1]) for pair in pairs]

# З використанням starmap
result_with_starmap = list(starmap(add, pairs))

"""
2. Зручність у випадках, коли функція приймає більше одного аргумента: starmap особливо зручна, коли функція приймає 
більше одного аргумента, оскільки не потрібно розгортати кожний аргумент окремо."""


# Функція, яка приймає два аргументи
def multiply(x, y):
    return x * y


pairs = [(2, 3), (4, 5), (6, 7)]

# З використанням starmap
result = list(starmap(multiply, pairs))

"""
3. Ліниве вироблення: Так само, як і багато інших інструментів з itertools, starmap може виробляти значення ліниво, 
що дозволяє оптимізувати ресурси та працювати з великими об'ємами даних.

4. Допоміжна функція для каррінгу: Іноді вона використовується як зручний спосіб для каррінгу функцій, особливо коли 
маєте велику кількість кортежів з аргументами для обробки."""


def add(x, y):
    return x + y


# Застосування часткового застосування за допомогою starmap
add_with_partial_application = starmap(lambda args: add(*args), [(1, 2), (3, 4), (5, 6)])
"""
В цілому, starmap допомагає спростити і зробити більш елегантним код при роботі з функціями, які очікують 
послідовності аргументів у вигляді кортежів чи інших ітерабельних об'єктів.
"""